# BAF507E Finanacial Database - Week1

## Subject : Introduction to Pandas

## Sungeun Jo (ID : 20204150)

In [3]:
print("Hello World")

Hello World

In [4]:
import pandas as pd

In [5]:
rid = [1,2,3,4,5]
gender = ["M","F","F","M","F"]
weight = [68.5, 50.2, 45.5, 80.5, 55.0]
height = [175, 150, 155, 165, 160]

In [6]:
data = {
    'id' : rid,
    'gender' : gender,
    'weight' : weight,
    'height' : height,
}

In [7]:
df1 = pd.DataFrame(data=data)

In [8]:
df1

   id gender  weight  height
0   1      M    68.5     175
1   2      F    50.2     150
2   3      F    45.5     155
3   4      M    80.5     165
4   5      F    55.0     160

In [9]:
df1.columns

Index(['id', 'gender', 'weight', 'height'], dtype='object')

In [10]:
df1.loc[1]

id           2
gender       F
weight    50.2
height     150
Name: 1, dtype: object

In [11]:
df1 = df1.set_index('id')

In [12]:
df1

   gender  weight  height
id
1       M    68.5     175
2       F    50.2     150
3       F    45.5     155
4       M    80.5     165
5       F    55.0     160

In [13]:
df1.loc[1]

gender       M
weight    68.5
height     175
Name: 1, dtype: object

In [14]:
df1.iloc[1]

gender       F
weight    50.2
height     150
Name: 2, dtype: object

In [15]:
df1.loc[1:3]

   gender  weight  height
id
1       M    68.5     175
2       F    50.2     150
3       F    45.5     155

In [16]:
df1['gender']

id
1    M
2    F
3    F
4    M
5    F
Name: gender, dtype: object

In [17]:
df1[['gender', 'weight']]

   gender  weight
id
1       M    68.5
2       F    50.2
3       F    45.5
4       M    80.5
5       F    55.0

In [18]:
df1[['gender']]

   gender
id
1       M
2       F
3       F
4       M
5       F

In [19]:
df1.loc[:,'gender']

id
1    M
2    F
3    F
4    M
5    F
Name: gender, dtype: object

In [20]:
df1.iloc[:,0:2]

   gender  weight
id
1       M    68.5
2       F    50.2
3       F    45.5
4       M    80.5
5       F    55.0

## Read Data From a File

In [21]:
pd.read_excel('note1.xlsx', sheet_name='TEST3')

   ID GENDER  WEIGHT  HEIGHT
0   1      M    68.5     175
1   2      F    50.2     150
2   3      F    45.5     155
3   4      M    80.5     165
4   5      F    55.0     160